#include <iostream>
#include <string>
using namespace std;

/*
?
? هتقارن الاول بالاخير ثم تزود الاول واحد وتقلل من الاخير واحد يعني بتقارن التاني بال قبل الاخير وهكذا لحد ميوصل للبيز كيس
?
?له اصلا شكلين الزوجي والفردي
?    ABCCBA
?    ABCBA
?
?تقدر تصوله لل بيز كيس بطريقتين
? الاولي:
?
?تجبره علي عدد اللفات لما تخليهي يلف السيز علي ال 2
?فالاولي هيعمل تلاته لوب يشيك فيهم والتانيه اتنين بس وال في نص كده كده مختلف
?
?التانيه:
?تهاندل كل كيس لوحدها
?الاولي هيخلص لما يوصل ان ال البدية بقت اكبر من النهاية
?التانيه هيخلص لما يوصل ان البداية بقت تساوي النهاية
?
?ولاما تعملها ببوينترين واحد قدام ويزيد وواحد ورا ويقل 
?او بواحد بس يقارن بين الاول ويقارن بالاخير
?
?


*/

int main()
{
    string s;
    cin >> s;

    size_t sz = s.length();

    for (size_t i = 0; i < sz / 2; i++)
    {

        if (s[i] != s[sz - 1 - i])
        {
            cout << "NO\n";
            return 0;
        }
    }

    cout << "YES\n";

    return 0;
}